--[[
神兽保佑！菩萨包邮！佛祖包邮！真主阿拉包邮！代码无BUG！！！
创建作者：Rabbit
创建时间：2015年8月10日23时56分59秒
感谢使用：更鸟游戏
]]
------------------------------------------
function 系统配置(t)
	t.title = "T-Aiko HD"			-- 文本型	窗口标题
	t.window.width	= 1280			-- 数值型	宽度
	t.window.height	= 720			-- 数值型	高度
	t.window.msaa		= 	0				-- 数值型	抗锯齿数
	t.window.vsync	=			true	-- 垂直同步
	t.window.borderless = false	-- 无边框
	t.window.resizable =	false 	-- 可调节大小
	t.window.fullscreen =	false	-- 全屏
	
	t.modules.joystick = 	false	-- 手柄
	t.modules.audio =			true 	-- 音频
	t.modules.sound =			true 	-- 声音流
	t.modules.physics =		false	-- 物理引擎
	t.modules.thread =		false	-- 线程系统
	t.modules.touch =			true	-- 触屏
end
-----------头部可以intro，变量等----------

------------------------------------------
function 引擎创建()
	--更鸟 1.3 版更新后，将资源路径管理 合并成为 2个函数，具体看下面的 说明
	
	--编译与调试，都能用的命令，取项目路径（），指向当前（更鸟工程）的路径，也是（编译后文件）的运行路径。For Example：
	置资源目录(取项目路径())
	
	--仅调试，能用的命令，取运行路径（），指向当前（更鸟游戏工作站IDE）的运行路径。For Example：
	--置资源目录(取运行路径().."/Example/GameRes")
	
	窗口宽,窗口高=图形取宽高()
	分辨率缩放倍率=窗口高/600
	LOGO= 创建图像("Logo.png")
	背景= 创建图像("back.jpg")
	开始按钮=创建图像("Play.png")
	退出按钮=创建图像("exit.png")
	设置按钮=创建图像("Confi.png")
	设置界面顶栏=创建图像("SETT.png")
	后退按钮=创建图像("back.png")
	工作室标志=创建图像("About.png")
	welcom圈圈=创建图像("WelcomeLogo.png")
	welcom文字=创建图像("Welcome.png")
	闪烁左=创建图像("left.png")
	闪烁右=创建图像("right.png")
	LOGO水波=创建图像("Round.png")
	UI粒子星星=创建图像("starblur.png")
	
	标题字体1= 创建字体("simhei.ttf", 30*分辨率缩放倍率)
	标题字体2=创建字体("simhei.ttf", 20*分辨率缩放倍率)
	歌曲标题文字=创建字体("simhei.ttf", 15*分辨率缩放倍率)
	
	音乐最大距离=0
	LOGO音效 = 创建声音("Sound/menuhit.wav", "stream")
	返回音效=创建声音("Sound/menuback.wav", "stream")
	welcome音效=创建声音("Sound/Welcome.wav", "stream")
	初始音乐源=创建声音数据("Sound/WelcomeMusic.mp3")
	音乐最大距离=初始音乐源:getDuration()
	初始音乐=创建声音(初始音乐源)
	当前窗口="Welcom"
	待切换窗口="Welcom"
	遮罩切换=0
	遮罩透明度=0
	遮罩直接黑屏=0
	
	LOGO位置=窗口宽/2
	logo计时=0
	logo缩放=1000
	弹跳X坐标=窗口宽/2
	LOGO状态=0
	图标计时=0
	MP3的BPM=120.01
	LOGO按钮透明度=0
	闪烁动画节拍=0
	按下判断=0
	工作室标志缩放=600
	闪烁左透明度=0
	闪烁右透明度=0
	LOGO残影缩放=1000
	LOGO残影透明度=0
	时间百分比=0
	方块百分比=0
	LOGO波纹 = {}
	粒子星星 ={}
	
	Welcome透明度=0
	Welcome计数=0
	Welcome启动=0
	Welcome总缩放倍率=1
end
------------------------------------------

function 逻辑更新(dt)
	鼠标X坐标=鼠标取横坐标()
	鼠标Y坐标=鼠标取纵坐标()
	if Welcome启动==0  then
		播放声音(welcome音效)
		Welcome启动=1
	end
	
	if Welcome启动==1 then
		if  Welcome透明度+10>=255 then
			if  Welcome计数>=1.8 then
				Welcome透明度=255
			end
			Welcome计数=Welcome计数+取最后帧时间()
		else
			if Welcome计数<1.8 then
				Welcome透明度=Welcome透明度+10
			end
		end
		
		if  Welcome计数>=1.5 then
			if 当前窗口=="Welcom" then
				遮罩切换窗口("UI",10,false )
			elseif Welcome透明度-20<=0 then
				Welcome透明度=0
			else
				Welcome透明度=Welcome透明度-20
			end
			Welcome总缩放倍率=Welcome总缩放倍率+0.001
		else
			Welcome总缩放倍率=Welcome总缩放倍率+0.0004
		end
		
		
	end
	
	
	-------------------UI----------------
	if 当前窗口=="UI" then
		
		-----LOGO逻辑
		logo计时=logo计时+取最后帧时间()
		if logo计时+取最后帧时间()>=60000/MP3的BPM/1000 then
			logo缩放=1100
			logo计时=0
			闪烁动画节拍=闪烁动画节拍+1
			LOGO残影缩放=1100
			LOGO残影透明度=100
			local 临时水波 ={x = 弹跳X坐标,Al=70,缩放=1000}
			table.insert(LOGO波纹,临时水波)
			插入星星(10)
			if 闪烁动画节拍 >=4 then
				闪烁动画节拍=0
				闪烁左透明度=200
				闪烁右透明度=200
				
			end
		end
		logo缩放=logo缩放+(1000 - logo缩放)*0.02
		
		LOGO残影缩放=LOGO残影缩放+(1200-LOGO残影缩放)*0.01
		if LOGO残影透明度-5<=0 then
			LOGO残影透明度=0
		else
			LOGO残影透明度=LOGO残影透明度-5
		end
		
		----水波逻辑
		for  n=#LOGO波纹,1,-1 do
			if n<= #LOGO波纹 then
				LOGO波纹[n].缩放=LOGO波纹[n].缩放+10
				if LOGO波纹[n].Al-1<=0 then
					table.remove(LOGO波纹,n)
				else
					LOGO波纹[n].Al=LOGO波纹[n].Al-1
				end
			end
		end
		-- LOGO移动逻辑
		if LOGO状态==0 then
			弹跳X坐标=弹跳X坐标+(窗口宽/2-弹跳X坐标)*0.1
		else
			弹跳X坐标=弹跳X坐标+(窗口宽/2-150*分辨率缩放倍率-弹跳X坐标)*0.1
		end
		if 图标计时>=5 then
			LOGO状态=0
		else
			图标计时=图标计时+取最后帧时间()
		end
		--LOGO按键判断
		if 判断是否进入区域 (弹跳X坐标-200*分辨率缩放倍率, 弹跳X坐标+200*分辨率缩放倍率, 窗口高/2-250*分辨率缩放倍率, 窗口高/2+200*分辨率缩放倍率) == true then
			if 鼠标是否按下(1)== true then
				LOGO状态=1
				图标计时=0
				if 按下判断==0 then
					停止播放(LOGO音效)
					播放声音(LOGO音效)
					按下判断=1
				end
			end
		end
		---退出按钮判断
		if LOGO状态==1 then
			if 判断是否进入区域 (窗口宽/2+40*分辨率缩放倍率, 窗口宽/2+310*分辨率缩放倍率, 窗口高/2-30*分辨率缩放倍率, 窗口高/2+50*分辨率缩放倍率)== true then
				if  鼠标X坐标>= LOGO位置+30 then
					if 鼠标是否按下(1)== true then
						if 按下判断==0 then
							停止播放(LOGO音效)
							播放声音(LOGO音效)
							遮罩切换窗口("EXIT",20,false )
							按下判断=1
						end
					end
				end
			end
		end
		------LOGO按钮动画逻辑
		if LOGO状态==1 then
			if  LOGO按钮透明度+10>=255 then
				LOGO按钮透明度=255
			else
				LOGO按钮透明度=LOGO按钮透明度+10
			end
		end
		if  LOGO状态==0 then
			if  LOGO按钮透明度-10<=0 then
				LOGO按钮透明度=0
			else
				LOGO按钮透明度=LOGO按钮透明度-10
			end
		end
		------LOGO按钮动画逻辑
		--设置按钮判定
		if 判断是否进入区域 (窗口宽-70*分辨率缩放倍率,窗口宽,窗口高-70*分辨率缩放倍率,窗口高)== true then
			if 鼠标是否按下(1)== true then
				if 按下判断==0 then
					停止播放(LOGO音效)
					播放声音(LOGO音效)
					遮罩切换窗口("SETT",20,false )
					按下判断=1
				end
			end
		end
		----工作室图标动态
		if 判断是否进入区域 (0, 200*分辨率缩放倍率, 窗口高- 100*分辨率缩放倍率, 窗口高)== true then
		if  鼠标是否按下(1)== true then
			工作室标志缩放=工作室标志缩放+(500-工作室标志缩放)*0.4
		else
			工作室标志缩放=工作室标志缩放+(600-工作室标志缩放)*0.4
		end
	end
	星星逻辑()
	进度条逻辑()
end
------------

------------------闪烁动画逻辑
if 闪烁左透明度-10<=0 then
	闪烁左透明度=0
else
	闪烁左透明度=闪烁左透明度-5
end
if 闪烁右透明度-10<=0 then
	闪烁右透明度=0
else
	闪烁右透明度=闪烁右透明度-5
end



-------------UI---------------

----初始音乐循环播放-----
if  当前窗口=="Welcom"  then
else
	播放声音(初始音乐)
end

----初始音乐循环播放-----

-------------exit---------
if 当前窗口=="EXIT" then
	事件停止()
end
-------------exit---------

-----------SETT---------------
if 当前窗口=="SETT" then
	if 判断是否进入区域 (0*分辨率缩放倍率, 70*分辨率缩放倍率, 0*分辨率缩放倍率, 70*分辨率缩放倍率)== true then
		if 鼠标是否按下(1)== true then
			if 按下判断==0 then
				停止播放(返回音效)
				播放声音(返回音效)
				遮罩切换窗口("UI",20,false )
				按下判断=1
			end
		end
	end
end
----------SETT------------------




----遮罩切换逻辑------------
if 遮罩切换 >=1 then
	if 遮罩切换==1 then
		if 遮罩透明度+遮罩切换速度>=255 then
			遮罩透明度=255
			遮罩切换=2
			当前窗口=待切换窗口
			else
			遮罩透明度=遮罩透明度+遮罩切换速度
		end
	end
	if 遮罩切换==2 then
		if 遮罩透明度-遮罩切换速度<=0 then
			遮罩透明度=0
			遮罩切换=0
		else
			遮罩透明度=遮罩透明度-遮罩切换速度
		end
	end
end
end
------------------------------------------

function 画面显示()
	清屏(0,0,0)
	
	
	
	
	
	
	--------UI---------
	if 当前窗口=="UI" then
		绘制(背景, 0, 0,0,0.6*分辨率缩放倍率,0.6*分辨率缩放倍率)
		星星渲染()
		---------水波渲染
		for  n=#LOGO波纹,1,-1 do
			置颜色(255,255,255,LOGO波纹[n].Al)
			绘制(LOGO水波,LOGO波纹[n].x,窗口高/2-50*分辨率缩放倍率,0,LOGO波纹[n].缩放/1000*分辨率缩放倍率,LOGO波纹[n].缩放/1000*分辨率缩放倍率,300,300)
		end
		---------水波渲染
		---------LOGO按钮渲染
		置颜色(255,255,255,LOGO按钮透明度)
		绘制(开始按钮,LOGO位置-40*分辨率缩放倍率,窗口高/2-150*分辨率缩放倍率,0,分辨率缩放倍率/4,分辨率缩放倍率/4)
		绘制(退出按钮,LOGO位置-40*分辨率缩放倍率,窗口高/2-50*分辨率缩放倍率,0,分辨率缩放倍率/4,分辨率缩放倍率/4)
		置颜色(255,255,255,255)
		绘制(设置按钮,窗口宽-30*分辨率缩放倍率,窗口高-30*分辨率缩放倍率,0,分辨率缩放倍率,分辨率缩放倍率,28.5,24.5)
		---------按钮渲染
		---------LOGO渲染
		置颜色(255,255,255,255)
		绘制(LOGO,弹跳X坐标,窗口高/2- 50*分辨率缩放倍率,0,0.2*分辨率缩放倍率*logo缩放/1000,0.2*分辨率缩放倍率*logo缩放/1000,1000,1000)
		置颜色(255,255,255,LOGO残影透明度)
		绘制(LOGO,弹跳X坐标,窗口高/2- 50*分辨率缩放倍率,0,0.2*分辨率缩放倍率*LOGO残影缩放/1000,0.2*分辨率缩放倍率*LOGO残影缩放/1000,1000,1000)
		---------LOGO渲染
		置颜色(255,255,255,闪烁左透明度)
		绘制(闪烁左,0,0,0,分辨率缩放倍率,分辨率缩放倍率)
		置颜色(255,255,255,闪烁右透明度)
		绘制(闪烁右,窗口宽-200*分辨率缩放倍率,0,0,分辨率缩放倍率,分辨率缩放倍率)
		置颜色(255,255,255,255)
		绘制(工作室标志,0,窗口高,0,分辨率缩放倍率*工作室标志缩放/1000,分辨率缩放倍率*工作室标志缩放/1000,0,200)
		置颜色(255, 255, 255,50)
		画矩形("fill",10*分辨率缩放倍率, 6*分辨率缩放倍率,320*分辨率缩放倍率,30*分辨率缩放倍率)
		时间百分比=初始音乐:tell()/音乐最大距离*100
		方块百分比=方块百分比+(3.2*时间百分比-方块百分比)*0.3
		置颜色(255, 255, 255,100)
		画矩形("fill",10*分辨率缩放倍率, 6*分辨率缩放倍率,方块百分比*分辨率缩放倍率,30*分辨率缩放倍率)
		置颜色(255,255,255,255)
		置字体(歌曲标题文字)
		画文本("RGS-Welcome",10*分辨率缩放倍率, 40*分辨率缩放倍率)
	end
	---------UI------------
	
	
	
	
	
	
	---------SET-----------
	if 当前窗口=="SETT" then
		绘制(背景, 0, 0,0,0.6*分辨率缩放倍率,0.6*分辨率缩放倍率)
		置颜色(5, 33, 53,255)
		画矩形("fill",150*分辨率缩放倍率,0,30*分辨率缩放倍率,窗口高)
		置颜色(255,255,255,255)
		绘制(设置界面顶栏,0,0,0,分辨率缩放倍率*1.5,分辨率缩放倍率*1.5,28.5,24.5)
		绘制(后退按钮 ,40*分辨率缩放倍率, 35*分辨率缩放倍率,0,分辨率缩放倍率,分辨率缩放倍率,36.5,32)
		置字体(标题字体1)
		画文本("首选项",70*分辨率缩放倍率, 5*分辨率缩放倍率)
		置字体(标题字体2)
		画文本("设定你的游戏",70*分辨率缩放倍率, 40*分辨率缩放倍率)
	end
	---------SET-------------
	
	
	
	
	------welcom-------
	置颜色(255,255,255,Welcome透明度)
	绘制(welcom文字,窗口宽/2, 窗口高/2-50*分辨率缩放倍率,0,分辨率缩放倍率*Welcome总缩放倍率*0.5,分辨率缩放倍率*Welcome总缩放倍率*0.5,500,500)
	绘制(welcom圈圈,窗口宽/2, 窗口高/2-50*分辨率缩放倍率,0,分辨率缩放倍率*Welcome总缩放倍率*0.5,分辨率缩放倍率*Welcome总缩放倍率*0.5,500,500)
	-----遮罩切换显示
	置颜色(0,0,0,遮罩透明度)
	画矩形("fill", 0, 0, 窗口宽, 窗口高)
	置颜色(255,255,255,255)
	
	置字体(标题字体1)
	画文本("FPS:"..tonumber(取帧率()),窗口宽-90*分辨率缩放倍率, 0*分辨率缩放倍率)
end
------------------------------------------
function 星星渲染()
	for  n=#粒子星星,1,-1 do
		置颜色(255,255,255,粒子星星[n].透明度)
		绘制(UI粒子星星,粒子星星[n].x,粒子星星[n].y,粒子星星[n].旋转度,分辨率缩放倍率*0.3,分辨率缩放倍率*0.3,33,34)
		置颜色(255,255,255,255)
	end
end
-----------------------------------------
function 星星逻辑()
	for  n=#粒子星星,1,-1 do
		if 粒子星星[n].渐隐== false then
			if  粒子星星[n].透明度+粒子星星[n].速度>=255 then
				粒子星星[n].渐隐= true
			else
				粒子星星[n].透明度=粒子星星[n].透明度+粒子星星[n].速度
			end
		elseif 粒子星星[n].透明度-粒子星星 [n].速度<=0 then
			粒子星星[n].透明度=0
		else
			粒子星星[n].透明度=粒子星星[n].透明度-粒子星星 [n].速度
		end
		if  粒子星星[n].左右==1 then
			粒子星星[n].旋转度=粒子星星 [n].旋转度-粒子星星[n].速度/100
		else
			粒子星星[n].旋转度=粒子星星 [n].旋转度+粒子星星[n].速度/100
		end
	end
	for  n=#粒子星星,1,-1 do
		if  n<=#粒子星星 then
			if  粒子星星[n].透明度==0 then
				if  粒子星星[n].渐隐==true then
					table.remove(粒子星星,n)
				end
			end
		end
	end
end
--------------------------------------------
function 插入星星(个数)
	for  n=个数,1,-1 do
		local 临时星星={x= 取随机数(-10, 窗口宽),y= 取随机数(-10, 窗口高),渐隐= false,透明度=0,旋转度=0,速度= 取随机数(3,6),左右=取随机数(1,2)}
		table.insert(粒子星星,临时星星)
	end
end


--------------------------------------
function 进度条逻辑()
	if  判断是否进入区域(10*分辨率缩放倍率,330*分辨率缩放倍率,6*分辨率缩放倍率,36*分辨率缩放倍率) == true then
		if 鼠标是否按下(1)== true then
			if 按下判断==0 then
				local 当前鼠标距离=音乐最大距离*(鼠标X坐标-10*分辨率缩放倍率)/(3.2*分辨率缩放倍率)/100
				if  当前鼠标距离>音乐最大距离 then
				初始音乐:seek(音乐最大距离)
				elseif  当前鼠标距离<0 then
				初始音乐:seek(0)
				else
				初始音乐:seek(当前鼠标距离)
				end
				按下判断=1
			end
		end
	end
end
--------------------------------------
function 判断是否进入区域(ox,ex,oy,ey)
	if 鼠标X坐标>=ox and 鼠标X坐标<=ex and 鼠标Y坐标<=ey and 鼠标Y坐标>=oy then
		return true
	else
		return false
	end
end

------------------------------------------
function 遮罩切换窗口(name,speed,black)
	if black== true  then
		遮罩切换=2
	else
		遮罩切换=1
	end
	
	遮罩切换速度=speed
	待切换窗口=name
end
------------------------------------------
function 键盘按下(key)
	
end
------------------------------------------
function 初始化分辨率()
	
end
function 键盘放开(key)
	if key == "escape" then
		if 当前窗口=="SETT" then
			遮罩切换窗口("UI",20,false )
			停止播放(返回音效)
			播放声音(返回音效)
		end
		if 当前窗口=="UI" then
			遮罩切换窗口("EXIT",20,false )
			停止播放(返回音效)
			播放声音(返回音效)
		end
	end
end
------------------------------------------

function 鼠标按下(x,y,b)
	
end
------------------------------------------

function 鼠标放开(x,y,b)
	按下判断=0
end
------------------------------------------

function 鼠标移动(x,y,dx,dy)
	
end
------------------------------------------

function 滚轮移动(x,y)
	
end
------------------------------------------

function 窗口即将销毁()
	
	return false
end
------------------------------------------

function 窗口尺寸变化(w,h)
	
end
------------------------------------------

function 窗口获得焦点(f)
	
end
------------------------------------------

function 窗口鼠标进入(f)
	
end
------------------------------------------

function 窗口可视状态(v)
	
end
------------------------------------------

function 线程错误消息(thread,errstr)
	
end
------------------------------------------

function 拖放目录(dir)
	
end
------------------------------------------

function 拖放文件(f)
	
end
------------------------------------------

function 文本输入(t)
	
end
------------------------------------------

function 文本编辑(t,s,l)
	
end
------------------------------------------

function 屏幕按下(id,x,y,dx,dy,p)
	
end
------------------------------------------

function 屏幕放开(id,x,y,dx,dy,p)
	
end
------------------------------------------

function 屏幕释放(id,x,y,dx,dy,p)
	
end
------------------------------------------

function 低内存处理()
	
end
----------------------------------
